EG0xy/ArduinoProject/Arduino_IDE_Hack/hardware/arduino/avr/boards.txt
menu.cpu=CPU

##############################################################

juno.name=〖Juno AVR〗
juno.upload.tool=avrdude
juno.upload.protocol=arduino
juno.bootloader.tool=avrdude
juno.bootloader.unlock_bits=0x3F
juno.bootloader.lock_bits=0x0F
juno.build.board=AVR_juno
juno.build.core=arduino
juno.build.variant=eightanaloginputs


###############################################################
juno.menu.cpu.atmega8-8mhz=【Atmega8 - 8Mhz】

juno.menu.cpu.atmega8-8mhz.upload.maximum_size=8192
juno.menu.cpu.atmega8-8mhz.upload.maximum_data_size=512
juno.menu.cpu.atmega8-8mhz.upload.speed=57600

juno.menu.cpu.atmega8-8mhz.bootloader.low_fuses=0xe4
juno.menu.cpu.atmega8-8mhz.bootloader.high_fuses=0xd9
juno.menu.cpu.atmega8-8mhz.bootloader.file=optiboot/optiboot_atmega8.hex

juno.menu.cpu.atmega8-8mhz.build.mcu=atmega8
juno.menu.cpu.atmega8-8mhz.build.f_cpu=8000000L


###############################################################
juno.menu.cpu.atmega8-1mhz=【Atmega8 - 1Mhz】

juno.menu.cpu.atmega8-1mhz.upload.maximum_size=8192
juno.menu.cpu.atmega8-1mhz.upload.maximum_data_size=512
juno.menu.cpu.atmega8-1mhz.upload.speed=19200

juno.menu.cpu.atmega8-1mhz.bootloader.low_fuses=0xe1
juno.menu.cpu.atmega8-1mhz.bootloader.high_fuses=0xd9
juno.menu.cpu.atmega8-1mhz.bootloader.file=optiboot/optiboot_atmega8.hex

juno.menu.cpu.atmega8-1mhz.build.mcu=atmega8
juno.menu.cpu.atmega8-1mhz.build.f_cpu=1000000L

###############################################################

juno.menu.cpu.atmega8-16mhz=【Atmega8 - 16Mhz Ext】

juno.menu.cpu.atmega8-16mhz.upload.maximum_size=8192
juno.menu.cpu.atmega8-16mhz.upload.maximum_data_size=512
juno.menu.cpu.atmega8-16mhz.upload.speed=19200

juno.menu.cpu.atmega8-16mhz.bootloader.low_fuses=0xFF
juno.menu.cpu.atmega8-16mhz.bootloader.high_fuses=0xd9
juno.menu.cpu.atmega8-16mhz.bootloader.file=optiboot/optiboot_atmega8.hex

juno.menu.cpu.atmega8-16mhz.build.mcu=atmega8
juno.menu.cpu.atmega8-16mhz.build.f_cpu=16000000L

###############################################################
###############################################################

###############################################################
###############################################################

juno.menu.cpu.ATmega328-8mhz=【Atmega328 - 8Mhz】

juno.menu.cpu.ATmega328-8mhz.upload.maximum_size=30720
juno.menu.cpu.ATmega328-8mhz.upload.maximum_data_size=2048
juno.menu.cpu.ATmega328-8mhz.upload.speed=57600

juno.menu.cpu.ATmega328-8mhz.bootloader.low_fuses=0xe2
juno.menu.cpu.ATmega328-8mhz.bootloader.high_fuses=0xD9
juno.menu.cpu.ATmega328-8mhz.bootloader.extended_fuses=0xff
juno.menu.cpu.ATmega328-8mhz.bootloader.file=optiboot/optiboot_atmega328.hex

juno.menu.cpu.ATmega328-8mhz.build.mcu=atmega328p
juno.menu.cpu.ATmega328-8mhz.build.f_cpu=8000000L


###############################################################
juno.menu.cpu.ATmega328-1mhz=【Atmega328 - 1Mhz】

juno.menu.cpu.ATmega328-1mhz.upload.maximum_size=30720
juno.menu.cpu.ATmega328-1mhz.upload.maximum_data_size=2048
juno.menu.cpu.ATmega328-1mhz.upload.speed=57600

juno.menu.cpu.ATmega328-1mhz.bootloader.low_fuses=0x62
juno.menu.cpu.ATmega328-1mhz.bootloader.high_fuses=0xD9
juno.menu.cpu.ATmega328-1mhz.bootloader.extended_fuses=0xff
juno.menu.cpu.ATmega328-1mhz.bootloader.file=optiboot/optiboot_atmega328.hex

juno.menu.cpu.ATmega328-1mhz.build.mcu=atmega328p
juno.menu.cpu.ATmega328-1mhz.build.f_cpu=1000000L


###############################################################
juno.menu.cpu.ATmega328-16mhz=【Atmega328 - 16Mhz Ext】

juno.menu.cpu.ATmega328-16mhz.upload.maximum_size=30720
juno.menu.cpu.ATmega328-16mhz.upload.maximum_data_size=2048
juno.menu.cpu.ATmega328-16mhz.upload.speed=57600

juno.menu.cpu.ATmega328-16mhz.bootloader.low_fuses=0xFF
juno.menu.cpu.ATmega328-16mhz.bootloader.high_fuses=0xDA
juno.menu.cpu.ATmega328-16mhz.bootloader.extended_fuses=0x05
juno.menu.cpu.ATmega328-16mhz.bootloader.file=optiboot/optiboot_atmega328.hex

juno.menu.cpu.ATmega328-16mhz.build.mcu=atmega328p
juno.menu.cpu.ATmega328-16mhz.build.f_cpu=16000000L

###############################################################